### Questin 1(b)Read the data and create the same two (2) charts and their corresponding summarised tables produced in Part (a), using Python.

#### Count of Citizenship

In [ ]:
import pandas as pd

data = {'Citizenship': ['Citizen', 'Non-Resident', 'PR'],
        'Count of Citizenship': [197, 16, 37]
        }

df = pd.DataFrame(data)

print (df)

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
   
data = {'Citizenship': ['Citizen', 'Non-Resident', 'PR'],
        'Count of Citizenship': [197, 16, 37]}

df = pd.DataFrame(data,columns=['Citizenship', 'Count of Citizenship'])
df.plot(x ='Citizenship', y='Count of Citizenship', kind = 'bar')
plt.show()

#### Count of Performance Score

In [ ]:
import pandas as pd

data = {'Performance Score': ['Exceed', 'Meet', 'PIP', 'To Improve'],
        'Count of Performance Score': [30, 201, 2, 17]
        }

df = pd.DataFrame(data)

print (df)

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
   
data = {'Performance Score': ['Exceed', 'Meet', 'PIP', 'To Improve'],
        'Count of Performance Score': [30, 201, 2, 17]
        }

df = pd.DataFrame(data,columns=['Performance Score', 'Count of Performance Score'])
df.plot(x ='Performance Score', y='Count of Performance Score', kind = 'bar')
plt.show()

### Question 1(c) Find the length of service of all the staff, using Python. For staff who has not left the organization, use 1st May 2022 as the LeftDate. State the minimum, maximum and average length of service, expressing in years, rounded to 1 decimal place. (1 year is taken as 365 days.)

#### Import TMA_Data esxcel table to Python

In [1]:
import pandas as pd
import numpy as np
import datetime as dt
from datetime import date
import datetime

Data = pd.read_excel (r'C:\Users\user\OneDrive\OneNote Collections\SUSS-DESKTOP-S1E18FA\ANL252\TMA_Data.xlsx')
print(type(Data))
Data.head()

<class 'pandas.core.frame.DataFrame'>

,ID,Staff,BirthYear,Gender,Marital,Citizenship,Minority,JoinDate,LeftDate,Unit,Salary,Performance Score,Survey,Satisfaction,Absence
0,1,Aairah Hastings,1986-07-10 00:00:00,F,Single,Citizen,Yes,2012-02-04 00:00:00,NaN,Manufacturing,46335,Meet,3.4,5,15
1,2,Aaminah Mcmillan,05/25/86,F,Married,Citizen,No,2014-12-05 00:00:00,NaN,Manufacturing,66825,Meet,4.6,3,20
2,3,Aamna Howell,04/20/85,F,Single,Citizen,No,9/29/2014,NaN,Manufacturing,60446,Meet,3.4,4,14
3,4,Aayan Ferrell,1984-10-06 00:00:00,M,Married,Citizen,No,2016-05-01 00:00:00,NaN,Admin,93046,Meet,4.1,4,20
4,5,Ace Potter,1989-08-09 00:00:00,F,Divorced,Citizen,No,2011-11-07 00:00:00,2020-06-09 00:00:00,Manufacturing,50825,Meet,5.0,4,2

#### Find the length of service of all the staff using Python

In [5]:
Data["JoinDate"] = pd.to_datetime(Data["JoinDate"])
Data["LeftDate"] = Data["LeftDate"].replace(np.NaN,"2022-05-01")
Data["LeftDate"] = pd.to_datetime(Data["LeftDate"])
Data["LeftDate"].head()

0   2022-05-01
1   2022-05-01
2   2022-05-01
3   2022-05-01
4   2020-06-09
Name: LeftDate, dtype: datetime64[ns]

In [6]:
Data["JoinDate"].head()

0   2012-02-04
1   2014-12-05
2   2014-09-29
3   2016-05-01
4   2011-11-07
Name: JoinDate, dtype: datetime64[ns]

In [7]:
Data["Duration"]=Data["LeftDate"].sub(Data["JoinDate"])
Data["Duration"].head()

0   3739 days
1   2704 days
2   2771 days
3   2191 days
4   3137 days
Name: Duration, dtype: timedelta64[ns]

In [9]:
Data["Duration"] = Data["Duration"].dt.days
Data["Duration"] = Data["Duration"]/365
Data["Duration"] = Data["Duration"].round(decimals=2)
Data["Duration"].head()

0    10.24
1     7.41
2     7.59
3     6.00
4     8.59
Name: Duration, dtype: float64

In [10]:
Data["Duration"].describe()

count    250.000000
mean       6.768440
std        3.158164
min        0.070000
25%        4.640000
50%        7.280000
75%        8.740000
max       15.670000
Name: Duration, dtype: float64